<a href="https://colab.research.google.com/github/kajalpani/PySpark_work/blob/main/spark_dataframe_titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!apt-get install openjdk-8-jdk-headless -qq > /dev/null
!wget -q http://archive.apache.org/dist/spark/spark-3.1.1/spark-3.1.1-bin-hadoop3.2.tgz
!tar xf spark-3.1.1-bin-hadoop3.2.tgz
!pip install -q findspark

In [2]:
import os
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-3.1.1-bin-hadoop3.2"

In [3]:
import findspark
findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder.master("local[*]").getOrCreate()
spark.conf.set("spark.sql.repl.eagerEval.enabled", True) # Property used to format output tables better
spark

In [8]:
titanic_df = spark.read.csv('titanic_train.csv', header = True, inferSchema=True)
titanic_df

+------------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----+-----+--------------------+--------+
|passenger_id|pclass|                name|   sex| age|sibsp|parch|   ticket|   fare|cabin|embarked|boat| body|           home.dest|survived|
+------------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----+-----+--------------------+--------+
|        1216|     3|  Smyth, Miss. Julia|female|null|    0|    0|   335432| 7.7333| null|       Q|  13| null|                null|       1|
|         699|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0|   315089| 8.6625| null|       S|null| null|             Croatia|       0|
|        1267|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|   345773|  24.15| null|       S|null| null|                null|       0|
|         449|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3|    29105|   23.0| null|       S|   4| null|Cornwall / Akron, OH|       1|
|         576|     2|     Veal, Mr. James|  male|40.0|    0|    0|    28221|   13.0| null|       S|null| null|Barre, Co Washing...|       0|
|        1083|     3|Olsen, Mr. Henry ...|  male|28.0|    0|    0|   C 4001| 22.525| null|       S|null|173.0|                null|       0|
|         898|     3|Johnson, Mr. Will...|  male|19.0|    0|    0|     LINE|    0.0| null|       S|null| null|                null|       0|
|         560|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|   250648|   13.0| null|       S|  10| null|Finland / Washing...|       1|
|        1079|     3|  Ohman, Miss. Velin|female|22.0|    0|    0|   347085|  7.775| null|       S|   C| null|                null|       1|
|         908|     3|Jussila, Miss. Ma...|female|21.0|    1|    0|     4137|  9.825| null|       S|null| null|                null|       0|
|         313|     1|Widener, Mr. Harr...|  male|27.0|    0|    2|   113503|  211.5|  C82|       C|null| null|     Elkins Park, PA|       0|
|          43|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0|    11813|76.2917|  D15|       C|   8| null|    Philadelphia, PA|       1|
|         233|     1|Potter, Mrs. Thom...|female|56.0|    0|    1|    11767|83.1583|  C50|       C|   7| null|Mt Airy, Philadel...|       1|
|         446|     2|"Hocking, Miss. E...|female|20.0|    2|    1|    29105|   23.0| null|       S|   4| null|Cornwall / Akron, OH|       1|
|         602|     3|Abbott, Mr. Rossm...|  male|16.0|    1|    1|C.A. 2673|  20.25| null|       S|null|190.0| East Providence, RI|       0|
|         884|     3|Jensen, Mr. Niels...|  male|48.0|    0|    0|   350047| 7.8542| null|       S|null| null|                null|       0|
|         497|     2|Maybery, Mr. Fran...|  male|40.0|    0|    0|   239059|   16.0| null|       S|null| null|Weston-Super-Mare...|       0|
|        1003|     3|  McCoy, Mr. Bernard|  male|null|    2|    0|   367226|  23.25| null|       Q|  16| null|                null|       1|
|          36|     1|Bowerman, Miss. E...|female|22.0|    0|    1|   113505|   55.0|  E33|       S|   6| null|St Leonards-on-Se...|       1|
|        1088|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|   347079|  7.775| null|       S|   A| null|                null|       1|
+------------+------+--------------------+------+----+-----+-----+---------+-------+-----+--------+----+-----+--------------------+--------+
only showing top 20 rows

In [9]:
titanic_df.printSchema()

root
 |-- passenger_id: integer (nullable = true)
 |-- pclass: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- sex: string (nullable = true)
 |-- age: double (nullable = true)
 |-- sibsp: integer (nullable = true)
 |-- parch: integer (nullable = true)
 |-- ticket: string (nullable = true)
 |-- fare: double (nullable = true)
 |-- cabin: string (nullable = true)
 |-- embarked: string (nullable = true)
 |-- boat: string (nullable = true)
 |-- body: double (nullable = true)
 |-- home.dest: string (nullable = true)
 |-- survived: integer (nullable = true)

In [10]:
titanic_df.limit(5)

+------------+------+--------------------+------+----+-----+-----+------+------+-----+--------+----+----+--------------------+--------+
|passenger_id|pclass|                name|   sex| age|sibsp|parch|ticket|  fare|cabin|embarked|boat|body|           home.dest|survived|
+------------+------+--------------------+------+----+-----+-----+------+------+-----+--------+----+----+--------------------+--------+
|        1216|     3|  Smyth, Miss. Julia|female|null|    0|    0|335432|7.7333| null|       Q|  13|null|                null|       1|
|         699|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0|315089|8.6625| null|       S|null|null|             Croatia|       0|
|        1267|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|345773| 24.15| null|       S|null|null|                null|       0|
|         449|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3| 29105|  23.0| null|       S|   4|null|Cornwall / Akron, OH|       1|
|         576|     2|     Veal, Mr. James|  male|40.0|    0|    0| 28221|  13.0| null|       S|null|null|Barre, Co Washing...|       0|
+------------+------+--------------------+------+----+-----+-----+------+------+-----+--------+----+----+--------------------+--------+

In [12]:
titanic_df.select("passenger_id", "survived").limit(5)

+------------+--------+
|passenger_id|survived|
+------------+--------+
|        1216|       1|
|         699|       0|
|        1267|       0|
|         449|       1|
|         576|       0|
+------------+--------+

In [14]:
titanic_df.where((titanic_df.age >= 25) & (titanic_df.survived == 1)).limit(5)

+------------+------+--------------------+------+----+-----+-----+------+-------+-----+--------+----+----+--------------------+--------+
|passenger_id|pclass|                name|   sex| age|sibsp|parch|ticket|   fare|cabin|embarked|boat|body|           home.dest|survived|
+------------+------+--------------------+------+----+-----+-----+------+-------+-----+--------+----+----+--------------------+--------+
|         449|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3| 29105|   23.0| null|       S|   4|null|Cornwall / Akron, OH|       1|
|         560|     2|Sinkkonen, Miss. ...|female|30.0|    0|    0|250648|   13.0| null|       S|  10|null|Finland / Washing...|       1|
|          43|     1|Bucknell, Mrs. Wi...|female|60.0|    0|    0| 11813|76.2917|  D15|       C|   8|null|    Philadelphia, PA|       1|
|         233|     1|Potter, Mrs. Thom...|female|56.0|    0|    1| 11767|83.1583|  C50|       C|   7|null|Mt Airy, Philadel...|       1|
|        1088|     3|Olsson, Mr. Oscar...|  male|32.0|    0|    0|347079|  7.775| null|       S|   A|null|                null|       1|
+------------+------+--------------------+------+----+-----+-----+------+-------+-----+--------+----+----+--------------------+--------+

In [15]:
titanic_df.select("name","sex").where((titanic_df.age >= 25) & (titanic_df.survived == 1)).limit(5)

+--------------------+------+
|                name|   sex|
+--------------------+------+
|Hocking, Mrs. Eli...|female|
|Sinkkonen, Miss. ...|female|
|Bucknell, Mrs. Wi...|female|
|Potter, Mrs. Thom...|female|
|Olsson, Mr. Oscar...|  male|
+--------------------+------+

In [16]:
titanic_df.agg({"Fare":"avg"})

+------------------+
|         avg(Fare)|
+------------------+
|34.012700942284994|
+------------------+

In [21]:
titanic_df.groupBy("pclass").agg({"fare":"avg"}).orderBy("pclass", ascending=False)

+------+------------------+
|pclass|         avg(fare)|
+------+------------------+
|     3| 13.77492935010483|
|     2|21.259914457831325|
|     1| 91.15046601941741|
+------+------------------+

In [27]:
titanic_df.filter(titanic_df.age > 25).agg({"Fare":"avg"})

+-----------------+
|        avg(Fare)|
+-----------------+
|45.22928710526312|
+-----------------+

In [29]:
from pyspark.sql.types import IntegerType
from pyspark.sql.functions import udf

def round_float_down(x):
  return int(x)

round_float_dwn_udf = udf(round_float_down, IntegerType())

titanic_df.select('name','fare', round_float_dwn_udf('fare').alias("Fare rounded down")).limit(5)

+--------------------+------+-----------------+
|                name|  fare|Fare rounded down|
+--------------------+------+-----------------+
|  Smyth, Miss. Julia|7.7333|                7|
|     Cacic, Mr. Luka|8.6625|                8|
|Van Impe, Mrs. Je...| 24.15|               24|
|Hocking, Mrs. Eli...|  23.0|               23|
|     Veal, Mr. James|  13.0|               13|
+--------------------+------+-----------------+

In [30]:
titanic_df.createOrReplaceTempView("Titanic")

In [31]:
spark.sql("select * from Titanic limit 5")

+------------+------+--------------------+------+----+-----+-----+------+------+-----+--------+----+----+--------------------+--------+
|passenger_id|pclass|                name|   sex| age|sibsp|parch|ticket|  fare|cabin|embarked|boat|body|           home.dest|survived|
+------------+------+--------------------+------+----+-----+-----+------+------+-----+--------+----+----+--------------------+--------+
|        1216|     3|  Smyth, Miss. Julia|female|null|    0|    0|335432|7.7333| null|       Q|  13|null|                null|       1|
|         699|     3|     Cacic, Mr. Luka|  male|38.0|    0|    0|315089|8.6625| null|       S|null|null|             Croatia|       0|
|        1267|     3|Van Impe, Mrs. Je...|female|30.0|    1|    1|345773| 24.15| null|       S|null|null|                null|       0|
|         449|     2|Hocking, Mrs. Eli...|female|54.0|    1|    3| 29105|  23.0| null|       S|   4|null|Cornwall / Akron, OH|       1|
|         576|     2|     Veal, Mr. James|  male|40.0|    0|    0| 28221|  13.0| null|       S|null|null|Barre, Co Washing...|       0|
+------------+------+--------------------+------+----+-----+-----+------+------+-----+--------+----+----+--------------------+--------+